{
    "version": "https://jsonfeed.org/version/1",
    "title": "volecho.com",
    "description": "",
    "home_page_url": "https://volecho.com",
    "feed_url": "https://volecho.com/feed.json",
    "user_comment": "",
    "icon": "https://volecho.com/media/website/transparent-Photoroom.png",
    "author": {
        "name": "Volecho.com"
    },
    "items": [
        {
            "id": "https://volecho.com/joey-p-sharpens-the-contrast-on-missing-in-action/",
            "url": "https://volecho.com/joey-p-sharpens-the-contrast-on-missing-in-action/",
            "title": "Joey P. Sharpens the Contrast on MISSING IN ACTION",
            "summary": "Joey P. closes out 2025 by tightening his focus rather than widening&hellip;",
            "content_html": "<p data-start=\"56\" data-end=\"402\">Joey P. closes out 2025 by tightening his focus rather than widening the frame. MISSING IN ACTION is a short release, just two tracks, but it says more about his current headspace than a full album might. After a year that included viral momentum and serious streaming numbers, this feels like a controlled step forward, confident and deliberate.</p>\n<p class=\"align-center\" data-start=\"56\" data-end=\"402\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/2a1dff70K0i5OZXBkYQOzZ?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p data-start=\"56\" data-end=\"402\"> </p>\n<p data-start=\"404\" data-end=\"968\">Only One leans into clean pop instincts, polished vocals riding a smooth, bright production that recalls early Justin Bieber singles before pop fully blurred into EDM. It is catchy without trying too hard, the kind of track that slides easily onto radio playlists or late afternoon drives. Then comes Wrong With You, which shifts the lights down. The beat slows, the tone darkens, and Joey sinks back into R and B, letting space and restraint do the heavy lifting. His voice sits closer to the listener here, revealing cracks and questions rather than hooks alone.</p>\n<p data-start=\"970\" data-end=\"1387\" data-is-last-node=\"\" data-is-only-node=\"\">Production from Sandro Carr and Mr. Igotbars keeps both songs focused and modern, never cluttered. The contrast works because it feels honest. Fans of artists like Giveon, early The Weeknd, or Justin Timberlake’s moodier cuts will recognize the balance. MISSING IN ACTION plays like a short film with two scenes, one sunlit, one after midnight. It leaves you curious about what comes next, which is exactly the point.</p>",
            "image": "https://volecho.com/media/posts/119/volecho-music-magazine-48.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2026-01-17T02:24:10+02:00",
            "date_modified": "2026-01-17T02:24:10+02:00"
        },
        {
            "id": "https://volecho.com/wonders-on-giants-looking-back-without-getting-stuck-there/",
            "url": "https://volecho.com/wonders-on-giants-looking-back-without-getting-stuck-there/",
            "title": "Wonders on Giants Looking Back without Getting Stuck There",
            "summary": "Wōndering on Giants embodies the tradition of songwriting while never being bound&hellip;",
            "content_html": "<p>Wōndering on Giants embodies the tradition of songwriting while never being bound by it. With acoustic guitars, rhythmic patterns, and lyrics, it’s a contemplation of landscape and identity with a soothing voice. There’s a presence of the Highland landscape and the openness of Montana, but it’s not one of drama, just of quiet presence.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1VLm4Y8iiwM5ILONPrt9FP?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p><br><br>The music is played with a sense of control. There are gentle weavings of guitars, and the keyboards and basses are complementary and do not compete with the other instruments. The rhythm section is driving the music at a comfortable tempo. The production is warm and has a real sense of being performed. It has the introspective feel of Nick Drake or John Martyn or Van Morrison at his earliest.<br><br>What is most apparent, though, is the songwriting emphasis. The lyrics are significant in these instances, conveying meaning in a way that doesn’t rely on the superfluous. There’s a feeling of cyclical time, a meeting of the past and the present in terms of vision.</p>\n<p>Those listeners who respond to the records of the mid sixties through the seventies, for instance, will find a familiarity in this song that doesn’t rely on imitation.</p>",
            "image": "https://volecho.com/media/posts/118/volecho-music-magazine-6.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2026-01-16T12:18:57+02:00",
            "date_modified": "2026-01-17T02:20:00+02:00"
        },
        {
            "id": "https://volecho.com/night-wolf-and-lois-powell-turn-loss-into-motion-lost-my-way-home/",
            "url": "https://volecho.com/night-wolf-and-lois-powell-turn-loss-into-motion-lost-my-way-home/",
            "title": "Night Wolf &amp; Lois Powell – &quot;Turn Loss Into Motion&quot; – Lost My Way Home",
            "summary": "“Lost My Way Home” has a heavy calmness to it, one that&hellip;",
            "content_html": "<p>“Lost My Way Home” has a heavy calmness to it, one that relies more on atmosphere than spectacle. The Night Wolf-produced track establishes a cinematic feel, with the end and texture creating a broad, dark background. The vocal delivery by Lois Powell is direct and sincere, with no strain or emphasis on drama. While it's about accepting and persevering, it never comes across as preachy. Rather, it's an unfolding piece that relies on mood for storytelling.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/2ZG439LjY39kjc6JcROx8l?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p> </p>\n<p>The trip hop beats are juxtaposed with alt-pop and ambiance, and it's a sound that's at once close and expansive. It wouldn't have been amiss in the company of Massive Attack, London Grammar, or the more subdued tracks by Portishead. There is definitely a sense of territory being staked out here, particularly with the start of the record label EscaVolt Records in association with the release. “Lost My Way Home” is definitely a declaration of intent – and it is a declaration that will immediately appeal to those with an interest in film scores and late night play lists. It is music that is like a scene in a film and not just a song.</p>\n<p> </p>",
            "image": "https://volecho.com/media/posts/117/volecho-music-magazine-5.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2026-01-16T12:10:12+02:00",
            "date_modified": "2026-01-17T02:19:29+02:00"
        },
        {
            "id": "https://volecho.com/martin-howard-discovers-the-quiet-light-on-nylon-strings/",
            "url": "https://volecho.com/martin-howard-discovers-the-quiet-light-on-nylon-strings/",
            "title": "Martin Howard Discovers the Quiet Light on Nylon Strings",
            "summary": "Martin Howard’s latest guitar solo sounds like the pause button on a&hellip;",
            "content_html": "<p>Martin Howard’s latest guitar solo sounds like the pause button on a remote control pressed at just the right time. Recorded on a fifty-year-old classical guitar, it has a warm and clean sound, each note ringing out fully before the next one comes. There is definitely a classical background to this writing, but it never sounds formal. Folk patterns and contemporary flourishes keep it earthed.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/5f83vtRoIg611zufq6A6ID?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p><br><br>With the music reflecting the calm radiance of the moonscape painting that inspired it, the performance contains itself enough to allow the melody to speak for itself. Howard knows how to say a lot through a little. It’s a technique that evokes memories of musicians like Michael Hedges or Ry Cooder from way back when, when the guitar was both the rhythm and the vocals.<br><br>In a market that is currently dominated by cover versions and background instrumentals, Howard's commitment to creating new nylon string music is almost welcome. This is music that is better suited to quiet listening environments and is something that could sit alongside the scores by Gustavo Santaolalla or the more subdued sections of classical crossover albums. It is possible to create something emotively resonant with less.<br><br></p>",
            "image": "https://volecho.com/media/posts/116/volecho-music-magazine-4.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2026-01-16T12:09:28+02:00",
            "date_modified": "2026-01-17T02:19:06+02:00"
        },
        {
            "id": "https://volecho.com/the-mortal-prophets-blur-folk-memory-and-electric-shadow/",
            "url": "https://volecho.com/the-mortal-prophets-blur-folk-memory-and-electric-shadow/",
            "title": "The Mortal Prophets Blur Folk Memory and Electric Shadow",
            "summary": "John Beckmann approaches “The Mortal Prophets” more like a musical entity than&hellip;",
            "content_html": "<p>John Beckmann approaches “The Mortal Prophets” more like a musical entity than a band. Every record is more about atmosphere and setting, with songs playing like episodes from short stories that take place on the highways of the desert or in dimly lit rooms. “Americana” is there, but it’s not nostalgic. It’s like the guitars are worn, the voices are drifting, and the electronic elements are sneaking into the corners.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/3Y2UzZ6Uelgt7zmIuWlZ6R?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p><br><br>Beckmann’s prose is strongly suggestive. The lyrics draw on mysticism, poetry, and late-night trains of thought, leaving room for interpretation. You can hear nods towards Eno and Fripp in the ambient textures, the constant propulsion of kosmische music beneath it all, and glimmers of Pink Floyd in their earlier incarnation in the melodic lines. But it all comes down with a sense of clarity, never succumbing to abstraction for abstraction’s sake.<br><br>For anyone who likes artists such as Nick Cave, David Sylvian, or the darker side of Talk Talk, there is plenty to immerse oneself in here. The Mortal Prophets are a group whose sounds are perhaps better digested slowly, perhaps late at night, in the same way you might view an old film noir or a well-worn novel.<br><br></p>",
            "image": "https://volecho.com/media/posts/115/volecho-music-magazine-3.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2026-01-16T12:08:15+02:00",
            "date_modified": "2026-01-17T02:18:49+02:00"
        },
        {
            "id": "https://volecho.com/deathkrush-stares-down-the-end-with-plague-protocol/",
            "url": "https://volecho.com/deathkrush-stares-down-the-end-with-plague-protocol/",
            "title": "Deathkrush: Stares Down the End With Plague Protocol",
            "summary": "Plague Protocol has the sound of a record recorded under a black&hellip;",
            "content_html": "<p>Plague Protocol has the sound of a record recorded under a black sky, loud enough to drown out all else. Deathkrush embraces the weight and the size on this record, crafting tracks that have a physicality about them but never losing their form in the process. The guitars churn and writhe, low and thick, a body of tension that never abates. The drumming toggles from all-out sprint to crushing weight, imbuing the record with a vital, organic pulse that keeps the listener on the end of the next beat.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/326lQhg79XzAN3MBXpbsYs?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p><br><br>The vocals enter with a wash, screaming abrasively against deep, guttural rumbles. There isn’t a sense of frontman swagger, but rather a sense of multiple voices intersecting, ritualistic and feral. Lyrics find Plague Protocol circles collapse, both internal and cosmic, describing destruction as both terrifying and transformative. It recalls the weight of early Gojira, the drama of Fit for an Autopsy, and the bleak scope of contemporary deathcore, but doesn’t derive from any one source.<br><br>This is not background music. *Plague Protocol* requires attention, just as with other movies such as *Road* or *Children of Men*, which immerse you in a pessimistic atmosphere that lingers with you. Listeners seeking something heavy yet well-thought-out rather than just thrown together will appreciate what Deathkrush has to offer.</p>",
            "image": "https://volecho.com/media/posts/114/volecho-music-magazine-2.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2026-01-16T12:05:54+02:00",
            "date_modified": "2026-01-17T02:18:28+02:00"
        },
        {
            "id": "https://volecho.com/top-artist-of-2025-mike-vorpal/",
            "url": "https://volecho.com/top-artist-of-2025-mike-vorpal/",
            "title": "Top Artist of 2025: Mike Vorpal",
            "summary": "Mike Vorpal Turns Gloom Into Glow on House of Capricorn Mike Vorpal&hellip;",
            "content_html": "<p class=\"align-center\" data-start=\"61\" data-end=\"492\"><strong>Mike Vorpal Turns Gloom Into Glow on House of Capricorn</strong></p>\n<p data-start=\"61\" data-end=\"492\">Mike Vorpal writes songs that feel lived in, like rooms you remember long after you have left the lights on. House of Capricorn, a standout from his debut solo EP Memes, leans hard into that feeling. From its first guitar strike, the track settles into a tense push and pull between dark wave moodiness and sharp, physical guitar lines. It moves with intent but never rushes, letting each sound breathe just enough to leave a mark.</p>\n<p class=\"align-center\" data-start=\"61\" data-end=\"492\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/4tHVeF6F9HjqAnDe2uBToE?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p data-start=\"494\" data-end=\"935\">Vorpal’s production work is confident without being flashy. Synth lines hum beneath the surface, tangled with rough-edged guitars that sound scraped rather than polished. The result feels close and wide at the same time, like standing alone in a crowded club while the band locks into something heavy and hypnotic. His vocals stay low and open, carrying a quiet weight that suggests things left unsaid, thoughts circling rather than landing.</p>\n<p data-start=\"937\" data-end=\"1281\">House of Capricorn rewards repeat listens. Small shifts in rhythm and melody creep up on you, echoing the slow burn of records by artists like Interpol, early The National, or the more shadowed moments of Depeche Mode. There is also a cinematic pull here, the kind that would sit comfortably beside late night scenes from Drive or Donnie Darko.</p>\n<p data-start=\"1283\" data-end=\"1481\" data-is-last-node=\"\" data-is-only-node=\"\">Memes as a whole confirms Vorpal as an artist who understands restraint and tension. This is music for night drives, empty rooms, and anyone who finds comfort in songs that linger rather than shout.</p>",
            "image": "https://volecho.com/media/posts/113/volecho-music-magazine-47.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-12-31T16:07:07+02:00",
            "date_modified": "2025-12-31T16:07:07+02:00"
        },
        {
            "id": "https://volecho.com/top-releases-of-2025/",
            "url": "https://volecho.com/top-releases-of-2025/",
            "title": "Top Releases of 2025",
            "content_html": "<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1M6EVC86gK1mSOAH6G0QYv?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/0PCr0AwUkm6QIgLpt5SyFs?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/56xkN49mwjkZwetnNN2T6M?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1psIIofd5SLnUrzsCtH7nl?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1Tis3dJsOeKNGDcdf0E9CH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1Gdda2svzKz43K21QwDxWu?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/album/3Mk8Al1uUoybMMGr7q5sQE?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/10jN8o5VIySrXAXZi9rv0o?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/3LX0KsjaK8Qtkc2eMHZUKd?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/6byGVKgcMXXmqv091IYxvT?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1Gdda2svzKz43K21QwDxWu?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/4puOricJDDbYjhHxt5XAGL?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/7rs5BVjAxTAdWE5HNcGnNg?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/3uq5NYdIAEcy7enyCOmbWb?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/1NBpCkfvVMi6QYM6uncCnk?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>",
            "image": "https://volecho.com/media/posts/112/volecho-music-magazine-20.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-12-31T15:54:12+02:00",
            "date_modified": "2025-12-31T15:55:05+02:00"
        },
        {
            "id": "https://volecho.com/top-releases-29-12-25/",
            "url": "https://volecho.com/top-releases-29-12-25/",
            "title": "Top Releases 29-12-25",
            "content_html": "<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/5wey0qsBKfDLs9Pdn3bRpa?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/56xkN49mwjkZwetnNN2T6M?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1psIIofd5SLnUrzsCtH7nl?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1Tis3dJsOeKNGDcdf0E9CH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/track/1Gdda2svzKz43K21QwDxWu?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>\n<p class=\"align-center\"> </p>",
            "image": "https://volecho.com/media/posts/111/Top-Tracks-2xl.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-12-29T13:54:59+02:00",
            "date_modified": "2025-12-29T13:54:59+02:00"
        },
        {
            "id": "https://volecho.com/three-ways-to-say-it-out-loud-vulnerability-volume-and-self-made-vision/",
            "url": "https://volecho.com/three-ways-to-say-it-out-loud-vulnerability-volume-and-self-made-vision/",
            "title": "Three Ways To Say It Out Loud: Vulnerability, Volume, And Self-Made Vision",
            "summary": "The following features are now included in our online magazine which is&hellip;",
            "content_html": "<p class=\"align-center\">The following features are now included in our online magazine which is also available in print.</p>\n<p class=\"align-center\"><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">Issue #9</strong></p>\n<address class=\"align-center\"><address class=\"align-center\"><strong><a href=\"https://pubhtml5.com/jgwlo/nvab/\" target=\"_blank\" rel=\"noopener noreferrer\">Online Magazine</a> | <a href=\"https://www.lulu.com/shop/oddstone-printed-media-group/volecho-issue-9/paperback/product-q6wy542.html\" target=\"_blank\" rel=\"noopener noreferrer\">Print Magazine</a></strong></address><address> </address><address> <div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"250\" height=\"188\" style=\"width: 566px; height: 314px;\" src=\"https://online.pubhtml5.com/jgwlo/nvab/\" seamless=\"seamless\" scrolling=\"no\" frameborder=\"0\" allowtransparency=\"true\" allowfullscreen=\"allowfullscreen\"></iframe></div></address></address>\n<p><strong>Freya Magee Finds Wit and Wound in Indie Songs That Linger After Midnight</strong><br><br>The songs that Freya Magee writes are the kind that resemble scribbles on paper written in the dead of the night, sharp and witty and a little hurt and tender around the edges. She is a London-based artist, but she carries the whispers and shadows of her upbringing in Melbourne with most charming effect, as if she writes with a certain hesitance that translates beautifully into melody, accompanied by a softly understated percussion and lo-fi sounds that do not overpower the words themselves. She fits right in with other songwriters like Phoebe Bridgers and early Mitski, but the wit with which she expresses herself is uniquely hers.<br><br>Her first singles announced a pattern. \"Duplicity\" kept self-doubt at a steady, passionate simmer, while \"Forget Yourself Not\" introduced a snappier, anxious energy. The latest, \"Over There,\" moves again, this time incorporating a heavier, fuller-band sound, redolent of mid-2000s romantic comedies and alt-pop soundtracks. It launches aggressively, almost proudly, only to allow uncertainty to creep into the spaces. It's this push-and-pull where Magee finds her strongest voice.<br><br>The music remains quite subdued and thoughtful, and the emotional resonance comes from minute shifts in temperament. Anyone familiar with groups like Soccer Mommy, Alvvays, or the more subdued sections of Maggie Rogers’ earlier releases will have no shortage of things to relive and appreciate here. Magee is the type of songwriter whose first EP might autoplay on return to your apartment, on that late-night walk home and into the quietening sounds of your mind.<br><br><strong>VERSAINTS’s Bottle Chaos and Sweat on a Live Album That Refuses To Behave</strong><br><br>VERSAINTS are a band that seems to want to shake the walls more than sweep them tidy. There is a first-ever Brighton performance EP entitled Bloody Raw, and it is exactly what it says on the tin. Boisterous and loud and vibrating with a tense energy from a band feeding off a crowd for the very first time. The West Midlands trio take inspiration from 90s grunge and British post-punk bands with riffages that scrape and drummers trying to outrun the music.<br><br>The love for Nirvana, The Clash, and Pixies is evident in the rush from melodic moments to noise, but VERSAINTS remain earthy and tangible. The recording is not polished when it comes to the missed notes and blown-out amplifiers, and this is the brilliance about it. You are hearing the space where the band is pushing it until everything comes crashing down.<br><br>From their debut album SOS, it is clear they have the capability to pen tracks that truly kick, mixing emotions that come from the gut with hooks that linger. Bloody Raw simply illustrates that this music is even better when it is on the verge of boiling over. So, if what you enjoy is the raw, sweaty passion that can be gleaned from IDLES live performances, or the initial hype surrounding bands such as Shame, then this EP is a reinforcement that loud, fuzzy rock music is still relevant.<br><br><strong>Alexis Lace - Turns Reflection into Pop Soul on 'Tequila Sunrise'</strong><br><br>It seems that Alexis Lace learned to build a musical foundation from the grassroots up, doing everything in house, and this is reflected in Tequila Sunrise. It is a track which launches a fresh chapter from her album Silver, mixing catchy pop elements with trip-hop darkness and good old-fashioned R&amp;B warmth. While there is a nod to All Saints and Massive Attack in terms of atmosphere, Lace maintains all attention with her vocals, which possess both power and subtlety.<br><br>Tequila Sunrise is an album that reflects rebirth and the process of letting go of the weight that no longer serves a purpose in life. It is a refreshing sound that Lace uses effectively in this recording by allowing the lyrics to ride on a strong beat and solid layers in the background with a raw intimacy and confidence that does not rush to get to the point that has to be made. One thing that is most apparent is that it all feels so natural and organic. Lace is not following any trends or attempting to showcase her range. She lets this song ride at its own tempo, layering her emotion in tone as opposed to intensity. Fans of acts such as Jessie Ware, or even the softer sides of Alicia Keys or FKA twigs, will recognize elements in this song that feel both familiar and very intimate. This has a chance at being a record for late nights and quiet drives, something to be listened to while watching a reflection-filled film or a dramatic move. Tequila Sunrise points towards Lace finding a confident note about delivering pop music, one that prioritizes emotion over effect.</p>",
            "image": "https://volecho.com/media/posts/110/volecho-music-magazine-46.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-12-28T02:16:51+02:00",
            "date_modified": "2025-12-29T13:33:38+02:00"
        }
    ]
}
