{
    "version": "https://jsonfeed.org/version/1",
    "title": "volecho.com",
    "description": "",
    "home_page_url": "https://volecho.com",
    "feed_url": "https://volecho.com/feed.json",
    "user_comment": "",
    "icon": "https://volecho.com/media/website/transparent-Photoroom.png",
    "author": {
        "name": "Volecho.com"
    },
    "items": [
        {
            "id": "https://volecho.com/kristina-wilson-looks-beyond-the-disorder-with-debut-album-dating-broken-boys/",
            "url": "https://volecho.com/kristina-wilson-looks-beyond-the-disorder-with-debut-album-dating-broken-boys/",
            "title": "Kristina Wilson Looks Beyond the Disorder with Debut Album Dating Broken Boys",
            "summary": "By the time you press play on Kristina Wilson's debut album Dating&hellip;",
            "content_html": "<p class=\"align-left\">By the time you press play on Kristina Wilson's debut album Dating Broken Boys, released October 4, 2025, you'll know that you're in for something better than just another set of indie break-up songs. The Australian singer-songwriter has taken her Forestville apartment break-up session and planted it in a richly textured album half insightful observation, half confession, and half sarcastic humor. It's all about bad habits, self-destruction, and relief from laughing at oneself when the tears dry.<br><br>The album takes its title from Kristina's world constructed with Dumbitchitis, the acerbic single with indie-pop group Like Angels. The song, cheekily titled, and its painfully real lyrics about lingering too long in the bad love affair, is the thesis of the album: we all fall for things, occasionally for the people who don't deserve them, and the result is both tragic and comic. \"It's like if you've got a love infection when you're in love with somebody — or in love with who they are,\" Kristina explained the song, saying it was too ridiculous and too true to be left out of a song.<br><br>Dating Broken Boys seems to have come out of all those same moments — late-night cheap wine talks, sobbing to strangers who temporarily turn into overnight therapists, lengthy texts on your phone that you will never send. Kristina's writing is like a bedroom whisper but with the sting of a barbed-wire fence, the one that will leave you laughing at how damn ridiculous love makes us.<br><br>Musically, the album combines indie-pop, alt-folk, and rocks of inspiration into a paintbox that's fresh yet old. You get to hear the raw reality of Phoebe Bridgers, block anecdote politeness of Julia Jacklin, and rhythmic push of HAIM, but Kristina is not riding on her idols' coattails — she's carving out her own strip. Co-produced by Ethan Saunders and Ian Mehrle, the album weighs lean, folk-strained arrangements against larger moments that punch like a live show closer.<br><br>It's the type of arrival that doesn't only guarantee a career but that heralds an artist who's already a hell of a lot smarter than she needs to be. While other newcomers dance around genericities, Kristina Wilson plays for keeps. Her songs don't shy away from calling out the dirty things — the message you never should've sent, the ex you just can't help returning to, the stinging realization you weren't ever in love so much as addicted to drama.<br><br>Albums such as these cannot help but compare to pop culture icons. If Bridgers provided us with Punisher as the post-shift self-doubt playlist, and Olivia Rodrigo penned SOUR as the car scream during puberty, then Dating Broken Boys is in the middle ground — a rawly honest diary that still will not stop winking at you. It has the bite of Fleabag’s monologues and the bittersweet humor of a Greta Gerwig film, packaged in hooks you’ll hum long after.<br><br>Kristina has stated that she wished the record to have a mirror or friend quality about it, and she's achieved it. These songs are not written from a pedestal; they're written from the floor, cross-legged with you, laughing through the pain and scheming the next move. It's catharsis that doesn't get heavy-handed, healing that doesn't attempt to sound neat.<br><br>Dating Broken Boys is out October 4 on all platforms. If you’ve ever rolled your eyes at your own poor choices while secretly queuing up another sad-girl playlist, Kristina Wilson has made the album for you.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>",
            "image": "https://volecho.com/media/posts/45/volecho-music-magazine-5.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T12:09:49+03:00",
            "date_modified": "2025-09-26T12:09:49+03:00"
        },
        {
            "id": "https://volecho.com/ashia-ackov-contemplates-love-and-legacy-in-jazz-ballad-in-time/",
            "url": "https://volecho.com/ashia-ackov-contemplates-love-and-legacy-in-jazz-ballad-in-time/",
            "title": "Ashia Ackov Contemplates Love and Legacy in Jazz Ballad &quot;In Time&quot;",
            "summary": "Ashia Ackov's latest single, \"In Time,\" is an introspection on memory, love,&hellip;",
            "content_html": "<p class=\"align-left\">Ashia Ackov's latest single, \"In Time,\" is an introspection on memory, love, and the subdued burden of sacrifice. Going back to the legacy of Jazz Noire, the song finds inspiration in Ackov's grandparents and the tale of the 92nd Infantry soldiers who abandoned their brides when they shipped out for war. That tug-of-war between faith and doubt—\"Do I ever get to see you again? Is it worth it?\"—is the emotional center of this song, making it rich with depth that resonates long after the last note has dissolved. The music from the first chord is imbued with introspective warmth. Piano melodies roll along in subdued determination, conjuring waves, and muted brass provides illuminating wisps of soft, wistful light onto the story. An insistent rhythm propels the song along like a pulse, anchoring the listener in the force of chronology in the tale. Ackov's voice remains at the forefront, unbroken and slow, each line charged with history, desire, and a quiet hope that bridged past to present.<br><br>Listening to \"In Time\" is like reading a movie, the feeling of being ushered into one of the classic black-and-white films where a bride gestures farewell while a soldier slumps out of the window of an open train and remains suspended in tender promise. It's what makes this song so beautiful: its narrative. Ackov's music was always textured, but in this piece, the storytelling is simple and suggestive. The song doesn't just tell a phenomenon—s/he invites the audience to live it.<br><br>For music lovers who like music that fuses history and emotion, \"In Time\" will touch a chord, being a class of modern jazz ballads paying tribute to individual and shared memory, like Norah Jones' reflective songs or Gregory Porter's storytelling tradition. On Spotify, YouTube, Apple Music, and Amazon, \"In Time\" is a listen and commentary on measuring love and legacy. For emotionally charged, movie-inspired jazz fans, the song is one to listen to, giving way to a moment of pause for stories that are both personal, historical, and universal.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>",
            "image": "https://volecho.com/media/posts/44/volecho-music-magazine-4.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T12:08:15+03:00",
            "date_modified": "2025-09-26T12:08:15+03:00"
        },
        {
            "id": "https://volecho.com/jacqui-beaa-hits-her-stride-with-powerful-third-single-grid-me/",
            "url": "https://volecho.com/jacqui-beaa-hits-her-stride-with-powerful-third-single-grid-me/",
            "title": "Jacqui Beaa Hits Her Stride With Powerful Third Single &quot;Grid Me&quot;",
            "summary": "There's something great about seeing an artist come into their own, and&hellip;",
            "content_html": "<p class=\"align-left\">There's something great about seeing an artist come into their own, and Melbourne's Jacqui Beaa appears to be doing just that. Her third single Grid Me substitutes some of the raw emotion of her early work with a self-confident, groove-based anthem that struts its stuff brazenly while still having a hurtful bite. It's the sort of song that straddles dancefloor sing-along and bedroom diary confession, and it's all parts fun and oh-so-relatable.<br><br>At first listen, Grid Me is a breezy indie-pop anthem — jaunty basslines, jangly guitar chords, and a hooky beat that dares you not to get up and dance. But beneath its glittering surface is a nicer, more nuanced question that most of us have grappled with privately: why has my boyfriend never posted a photo of us on the internet? In an era where more frequently than not, relationships turn into a scoreboard, Beaa captures the paranoia and the humor of wondering whether love exists if it doesn't get pinned on the grid.<br><br>It's this equilibrium — flippant but poignant, danceable but introspective — that makes Grid Me mainstream. The song does not lecture and indulge. Rather, it smirks at the silliness of insecurities during an era of screens and declares just how much it still hurts. It's nearly the same as with the narrative strategy of Paramore's Still Into You, where cloying hooks are jammed up against honest emotional jabs. Listeners who have found themselves caught between laughing at their own neuroses and being bludgeoned by them will understand here.<br><br>Beaa's journey to this point is as complicated as her music. Born in Melbourne, she learned to play the guitar at four and spent her teenage years writing songs before breaking onto the city's pub and festival scene. At 20, she derailed into writing, directing and performing short films and even co-writing a mini musical for the 2023 Melbourne International Comedy Festival. It was a learning experience that honed her storytelling and theater skills, skills now spilling over into songwriting. When she came back to music with her debut single full-tilt later in 2024, it was apparent that she had found a voice that was both gritty and lovable.<br><br>Grid Me is a peak on this new chapter. It's like the song where Beaa owns it — assertive, clever, and unapologetically relatable. Maggie Rogers' ecstatic introspection fans or G Flip's honest, beat-driven pop lovers will discover a lot to adore here. And there's a hint of Ed Sheeran's ability to take normal worries and turn them into hooky, inescapable earworms that still replay long after the track has finished.<br><br>There’s also something cinematic about the track. The paranoia of waiting for your relationship to be Instagram official feels like the kind of subplot you’d catch in a Netflix coming-of-age film, nestled between moments of romantic comedy and heartbreak. Imagine To All the Boys I’ve Loved Before but with the stakes updated for the TikTok generation.<br><br>With only three singles to her name, Jacqui Beaa is on the first pages of her life as an artist, but Grid Me offers a glimpse of where she is going. Her skill in converting tiny doubts into songs that radiate confidence is a worthwhile accomplishment, one that separates a songwriter from an artist. You can all too easily imagine Grid Me blasting over festival crowds, the sort of song that individuals dance to with friends while silently wondering why somebody can't respond to their texts.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>",
            "image": "https://volecho.com/media/posts/43/volecho-music-magazine-3.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T12:06:53+03:00",
            "date_modified": "2025-09-26T12:06:53+03:00"
        },
        {
            "id": "https://volecho.com/richard-standleys-neighbourhood-vibes-brings-the-streets-to-life/",
            "url": "https://volecho.com/richard-standleys-neighbourhood-vibes-brings-the-streets-to-life/",
            "title": "Richard Standley&#x27;s &quot;Neighbourhood Vibes&quot; Brings the Streets to Life",
            "summary": "There is something filmic to a song that sounds like somewhere. Cannock&hellip;",
            "content_html": "<p>There is something filmic to a song that sounds like somewhere. Cannock music tutor Richard Standley, who devotes his weekdays to getting primary school kids to sing scales and tunes, has gone and done just this with his first single Neighbourhood Vibes. Released September 13, 2025, the song sounds like the sound of suburban streets at twilight, headlights sweeping around corners, children pedaling bicycles, the thrum of everyday life morphing into something more charged.<br><br>Standley is a familiar face on the stage—he plays weekends with a covers band—but this single marks his first excursion into original electronica. Far from being trend-driven, he resorts to instincts built up over years of listening and tutoring. His influences manifest themselves in knowing guise. There's a touch of The Prodigy in the punch and energy, an homage to The Killers in magnitude and star appeal, and a retro video game nostalgia undertone in the arpeggiated synths that evoke pixelated 80s and 90s landscapes.<br><br>The record clocks in at more than five minutes, Neighbourhood Vibes doesn't drag on. The song is presented as a night on the town that never stops changing—dancing to slick synth hooks one moment, finding oneself inexplicably stuck in some arpeggio flashback that teeters perilously on the brink of the meditative, before the beat kicks in again and the rhythm of possibility takes over. It's the kind of track that's just as good heard on headphones in isolation on a ride out as it is being blasted out of speakers before a night out with the lads.<br><br>There's also a refreshing freshness to the way Standley creates music. This is not the formulaic output of a producer searching for the formula; this is an album made in between lesson plans and Saturday afternoon broadcasts, with the same enthusiasm that goes into teaching a child their first chord. That tension between discipline and play you can hear in the music—disciplined enough to draw you in, but loose enough to breathe.<br><br>If you were to place Neighbourhood Vibes in amongst the rest, it would sit between the retro glow of Kavinsky, the melodic narration of M83, and the lead-and-centre, pulse-pounding beats of early Chemical Brothers. There's a filmic gloss that wouldn't be amis on a score—see the way electronic textures in Drive smeared neon desolation with adrenaline.<br><br>In the end, Standley built something subtly great: an album that resembles plain streets inflated to enormity. It's the park on the block, the line of houses, the small-town nightlife—all remixed and reprised on synths, beat, and imagination. With Neighbourhood Vibes, he's made a suburban English stillness a theater, and it's the sort of debut that will be remembered long after the final note is forgotten.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>",
            "image": "https://volecho.com/media/posts/42/volecho-music-magazine-2.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T12:05:08+03:00",
            "date_modified": "2025-09-26T12:05:25+03:00"
        },
        {
            "id": "https://volecho.com/ratfink-returns-with-raw-energy-on-plastic-bits/",
            "url": "https://volecho.com/ratfink-returns-with-raw-energy-on-plastic-bits/",
            "title": "Ratfink! Returns With Raw Energy on &#x27;Plastic Bits&#x27;",
            "summary": "Melbourne's Ratfink! are back with a snappy message. New single Plastic Bits,&hellip;",
            "content_html": "<p><br>Melbourne's Ratfink! are back with a snappy message. New single Plastic Bits, the third release from the forthcoming album When U Were Mine, sees the band's unique blend of three-chord rock energy and surf pop gloss. There's a hooky catchiness to the song which reminds one of the way early garage rock could be both urgent and fun, the kind of song that catches your head on first play.<br><br>The stimulus is close to hand: the city's waterways. Afternoon spent on the Merri River's muddy banks was followed by the band considering the plastic that blanketed the landscape. That consciousness leaks into the song in little details, from the slightly out-of-tune guitar lines that mimic the disorientation of rubbish to the beat that skips like water over rocks. The album blends social observation with playfulness, proving that Ratfink! is able to speak about real-world concerns without sacrificing the energy of rock n roll.<br><br>Current fans will see the familiar hooks and brute power that have characterized their output, but new listeners might find an identical draw in how groups like The Strokes or Thee Oh Sees combine immediacy with melody. Plastic Bits is economical but powerful, a sleek primer to the more expansive soundscapes and narrative the band are venturing into with When U Were Mine. It's a reminder that rock music can still be new, paying attention, and starkly alive, even constructed out of three basic chords.<br><br>For those who dig music that blends grit and intelligent thinking, Plastic Bits is a bull's-eye. It's a song to crank up loud, to hear the city in a new way, and to get stoked on what Ratfink! has next.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>",
            "image": "https://volecho.com/media/posts/41/volecho-music-magazine-1.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T12:02:21+03:00",
            "date_modified": "2025-09-26T12:02:39+03:00"
        },
        {
            "id": "https://volecho.com/kaiyah-mercedes-turns-exes-into-fuel-with-sharp-edged-new-single/",
            "url": "https://volecho.com/kaiyah-mercedes-turns-exes-into-fuel-with-sharp-edged-new-single/",
            "title": "Kaiyah Mercedes Turns Exes Into Fuel With Sharp-Edged New Single",
            "summary": "There is something delicious about a song that laughs in the face&hellip;",
            "content_html": "<p class=\"align-left\">There is something delicious about a song that laughs in the face of its subject, and Kaiyah Mercedes knows exactly how to pull it off. With I’m Gonna Be Famous, the Melbourne-based queer pop-rock artist flips the script on the exes, friends, and hangers-on who once tried to shrink her voice or claim credit for her rise. It's cheeky, snappy, and brimming with the sort of sassy attitude that's present in Lily Allen, Olivia Rodrigo, and pre-peaking Charli XCX's line — acts who understand how to attach flames to truth. <br><br>The song explodes with jangly guitars, hooky hooks, and just the appropriate amount of grit. Kaiyah is both stubborn and playful sounding, spitting her back on past and stepping into own spotlight. At 19, she already has a woman's confidence in that she has rammed against the walls and not shrunk, instead taking up even more space. It is a song for anyone ever instructed to be quiet, smaller, less of themselves — and it throbs like a theme song, sneering and smirking in equal proportion.<br><br>Her ascent has been gradual but impressive. Two albums in with more than 1.2 million combined streams, Indie Arrivals, The Pop List, and Pop Sauce placements on Spotify, Kaiyah's established she ain't afraid of pushing genre. Indie pop is at its core, though folk and rock textures are woven throughout her songs, making her sound more like Phoebe Bridgers, Soccer Mommy, and beabadoobee. I’m Gonna Be Famous sharpens her sound even further, leaning into a rawer, rockier palette that suggests she is ready to throw punches instead of simply baring scars.<br><br>What makes Kaiyah stand out goes beyond the music. Diagnosed with autism and ADHD at 15, followed by a series of chronic illnesses, she has turned her body and brain into sources of resilience rather than restriction. Her music is not just catharsis, but maps of self-discovery, doorways to being young, queer, and unapologetically different. And that same honesty overflows into her live performances, which function more as point gatherers for community than as typical gigs. Fans are invited into a safe, charged environment that clinically reveres queer, disabled, and neurodivergent life — testimony that music can be art and sanctuary.<br><br>You can hear the echoes of pop culture's best comebacks against contempt and skepticism in I'm Gonna Be Famous. It takes the nod of Alanis Morissette's You Oughta Know, the teen zing of Mean Girls' revenge paybacks, and even the glee sting of Taylor Swift's We Are Never Ever Getting Back Together. But Kaiyah never takes on the tropes. Instead, she weaves her own take into a funny and needed song. It's easy to picture this playing in bedrooms, car rides, or at the end of the night when you're messing around with friends about the people who didn't think you were good enough.<br><br>The song is also, however, a commentary on fame itself — who gets to own it, who gets left out of the narrative, and how frequently women and queer artists are informed their success isn't theirs. By satirizing those claims in so many words, Kaiyah owns her narrative and won't give the praise away to anyone who sought to put her fire out.<br><br>Admirers of the same level of energy will be able to find it in Wet Leg's debut snappy sarcasm, MARINA's Electra Heart campy venom, or even Fleabag's camp confidence. They all tread what it takes to mock rejection's pain and make strength out of hurt. Kaiyah is definitely a member of that legacy, laying down her own voice among the emerging ranks of emerging creatives who refuse to be silenced.<br><br>At just 19, Kaiyah Mercedes has already carved out a reputation as one of Melbourne’s most compelling voices. With I’m Gonna Be Famous, she is not asking for recognition — she is declaring it. And the fun of it all is that she is in on the joke, tossing her past detractors a grin as she keeps moving forward.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>",
            "image": "https://volecho.com/media/posts/40/volecho-music-magazine.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-26T11:54:25+03:00",
            "date_modified": "2025-09-26T11:54:33+03:00"
        },
        {
            "id": "https://volecho.com/magazine/",
            "url": "https://volecho.com/magazine/",
            "title": "Magazine",
            "summary": "Our mission is to provide a platform that amplifies the voices of&hellip;",
            "content_html": "<p class=\"align-center\">Our mission is to provide a platform that amplifies the voices of independent and underground artists, showcasing their groundbreaking releases that might not get the spotlight they truly deserve. In the vast landscape of music, we strive to be the bridge between passionate listeners and the undiscovered brilliance of the underground.</p>\n<p class=\"align-center\"><strong>Issue #2</strong></p>\n<address class=\"align-center\"><strong><a href=\"https://online.pubhtml5.com/jgwlo/bzyq/\" target=\"_blank\" rel=\"noopener noreferrer\">Online Magazine</a> | <a href=\"https://www.peecho.com/print/en/1983467\" target=\"_blank\" rel=\"noopener noreferrer\">Print Magazine</a></strong></address><address> </address><address class=\"align-center\">\n<div class=\"peecho-preview-button\" title=\"Peecho\" data-publication=\"1983467\" data-filetype=\"pdf\" data-new-window=\"true\" data-text=\"ORDER PRINT 19.99 EUR\" data-noprice=\"true\" data-currency=\"EUR\" data-locale=\"en_EN\">Print</div>\n<p class=\"align-center\"><strong>\n<script type=\"text/javascript\">\n(function() {\nvar p=document.createElement(\"script\");p.type=\"text/javascript\";p.async=true;\nvar h=(\"https:\"==document.location.protocol?\"https://\":\"http://\");\np.src=h+\"d3aln0nj58oevo.cloudfront.net/button/preview/175761626190865620.js\";\nvar s=document.getElementsByTagName(\"script\")[0];s.parentNode.insertBefore(p,s);\n}).call(this);\n</script>\n<br><br>For more details contact us at: <a href=\"mailto:volechomag@gmail.com\" target=\"_blank\" rel=\"noopener noreferrer\">volechomag@gmail.com</a></strong></p>\n</address>",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-16T21:54:43+03:00",
            "date_modified": "2025-09-16T22:05:42+03:00"
        },
        {
            "id": "https://volecho.com/get-featured/",
            "url": "https://volecho.com/get-featured/",
            "title": "Get Featured",
            "summary": "If you're interested in getting featured in our magazine, website or blog&hellip;",
            "content_html": "<p>If you're interested in getting featured in our magazine, website or blog you can submit your music via <strong><a href=\"https://app.musosoup.com/submit/volechomag\" target=\"_blank\" rel=\"noopener noreferrer\">Musosoup</a></strong> and <strong><a href=\"https://app.one-submit.com/direct-submit/26717/2358/5525/Volecho-Magazine-blog-Music-Promotion\" target=\"_blank\" rel=\"noopener noreferrer\">One Submit</a></strong>.</p>\n<p>For more details message us at: <a href=\"mailto:volecho@gmail.com\" target=\"_blank\" rel=\"noopener noreferrer\">volecho@gmail.com</a></p>",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-16T16:01:44+03:00",
            "date_modified": "2025-09-16T22:03:29+03:00"
        },
        {
            "id": "https://volecho.com/interview-with-neverskin/",
            "url": "https://volecho.com/interview-with-neverskin/",
            "title": "Interview with Neverskin",
            "summary": "The following feature is now included in our online magazine which is&hellip;",
            "content_html": "<p class=\"align-center\">The following feature is now included in our online magazine which is also available in print.</p>\n<address class=\"align-center\"><strong><a href=\"https://online.pubhtml5.com/jgwlo/bzyq/\" target=\"_blank\" rel=\"noopener noreferrer\">Online Magazine</a> | <a href=\"https://www.peecho.com/print/en/1983467\" target=\"_blank\" rel=\"noopener noreferrer\">Print Magazine</a><br><br>For more details contact us at: <a href=\"mailto:volechomag@gmail.com\" target=\"_blank\" rel=\"noopener noreferrer\">volechomag@gmail.com</a></strong></address><hr>\n<p><strong>How did it feel to reunite musically after 20 years since Ambiossis?</strong><br><br>Clint: It actually was interesting. We didn't really hang out anymore for such a long time and I myself hadn't done anything with music for about 8 years.<br><br>One day I was jogging and listening to tunes when all of a sudden our old band Ambiossis popped up, whilest we did not upload the music on Spotify and I did not select it. So while I was running and one of the tracks kicked in, I was thinking, 'I wonder how Remy is doing?'. So I send him a message and we met up and basically expressed wanting to make some tunes in general.<br><br>The whole process went weirdly natural and was so smooth, the first track was lyrically and vocally written and recorded before the end of the next week, so we basically had our base down in no time.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p><br><strong>What was the spark that led to creating \"Snatched\"?</strong><br><br>Remy: We were sitting around while I jammed some grooves on my guitar. It reminded us of the old-school nu-metal we grew up with a groove that makes your head bop and gives you the urge to run through the streets for no reason at all. The verses and choruses came naturally, because back when we had a band together from 2003 to 2006 (Ambiossis), we already blended groove, rap verses, and big ballad-like choruses. It felt like we simply picked up where we left off in 2006.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/5HMwEqcFmgJ9BOyudzx6jr?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p><strong>What emotions do you hope listeners take from \"Snatched\"?</strong><br><br>Clint: I of course, hope it gives people a positive or helpful feeling or emotion, but honestly, any emotion will do. As long as people feel a certain way about what we made. Feel free to love the track, we hope you do, but also feel free to hate it or dislike it. Music is universal and the beauty of it, is that it connects with some and doesn't with others. There is enough to go around :) But of course, we make music and share it for people to hopefully connect to it and love it.<br><br><strong>Why did you choose to record in home studios instead of a traditional setup?</strong><br><br>Remy: With so many instruments being multi-sampled in the best studios, and plugins -especially guitar amps- sounding better than ever, particularly in the last five years, I personally don’t feel the need to record in a traditional studio. I have great memories of working in them, but it’s just not convenient for me. Recording at home saves money and removes time pressure. I've been recording demos at home since around 2000, and by 2003 I was already using a guitar amp sim floorboard for both live gigs and home sessions.</p>\n<p><strong>How has your creative process evolved since your early band days?</strong><br><br>Remy: It’s quite similar, but with all great sounding plugins and libraries these days I just start out with synths / weird sounds / drums before I even do guitars, because it sparks guitar riff idea's. Back then, we just had some rough guitar parts and vocal sketches as demos, often guessing what the final product would sound like. Now, while recording it almost sounds like the end product, which sparks more idea's. But we still sit around working out the guitar parts like the early days and Clint have his lyrics done in a couple of hours and he sends his vocal-demo the next day, so that stayed the same.<br><br><strong>What’s next for Neverskin after this debut single?</strong><br><br>Clint: Well, lets say we hope to reach as many people as we can with our debut single 'Snatched' first off.<br><br>Next step will be the release of our second single. I won't spoil to much about that one yet. Long term, we're more or less winging it and basing it on how people receive it. So although there are no plans yet, we could end up going live, recording an EP or album, or perhaps keeping it on the low. Let's see...</p>\n<p><strong>If you could describe your music in three words, what would they be?</strong><br><br>Clint: Oh that is a though one. I guess, 'Emotional' (full of all types of emotion), 'Free' (not limited by boundaries, we make what we feel, could be this now and something completely different later), 'Expressive' (lyrics are metaphorical, the music is whatever we feel like we want it to be)</p>\n<p> </p>",
            "image": "https://volecho.com/media/posts/36/Untitled-design-3.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-16T13:13:33+03:00",
            "date_modified": "2025-09-16T21:10:39+03:00"
        },
        {
            "id": "https://volecho.com/ja-lena-releases-bold-new-single-ana-elli-hena/",
            "url": "https://volecho.com/ja-lena-releases-bold-new-single-ana-elli-hena/",
            "title": "JA Lena Releases Bold New Single “Ana Elli Hena”",
            "summary": "The following feature is now included in our online magazine which is&hellip;",
            "content_html": "<p class=\"align-center\">The following feature is now included in our online magazine which is also available in print.</p>\n<address class=\"align-center\"><strong><a href=\"https://online.pubhtml5.com/jgwlo/bzyq/\" target=\"_blank\" rel=\"noopener noreferrer\">Online Magazine</a> | <a href=\"https://www.peecho.com/print/en/1983467\" target=\"_blank\" rel=\"noopener noreferrer\">Print Magazine</a><br><br>For more details contact us at: <a href=\"mailto:volechomag@gmail.com\" target=\"_blank\" rel=\"noopener noreferrer\">volechomag@gmail.com</a></strong></address><hr style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"><address class=\"align-center\"> </address>\n<p>When Serbian singer and performer JA Lena proclaims Ana Elli Hena—\"I Am the One Here\", she is not doing so for fun. It is a confident act of artistic assertion. This is a Serbian artist singing Egyptian Arabic, drawing on Balkan dynamism and oriental beats into a sound as obstreperous as it is spellbinding. It's the newest entry in her increasing body of work, and one that may be her most brazen so far.</p>\n<p class=\"align-center\"><strong>Follow Our Playlist For More Music!</strong></p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/playlist/7nCQfSSikvEPorn78ARusH?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" data-mce-fragment=\"1\"></iframe></div>\n<p>JA Lena has been gathering steam for the last several years with songs such as Katila and Gamila, both of which gave listeners a sense of her unique approach to blending traditions. Those songs promised much, but Ana Elli Hena leaves no doubt. The production is crisp, layered with throbbing percussion and melodies that sound ancient yet new, while her vocal performance cuts through the mix with conviction. It is more than a statement about sound, though. It is a statement about presence.<br><br>There is something compelling in how Lena moves between worlds. Having grown up in Serbia, she was immersed in the raw passion of Balkan music, a tradition founded on intricate rhythms and emotional directness. In Ana Elli Hena, she brings that heat to Arabic performance, where the modal scales and cyclical rhythms of Egyptian music provide her with something new to challenge. Rather than reducing those styles to something bland, she keeps tension between them alive. The song flourishes there.<br><br>This cross-cultural bridging is not just about musical structure, but also about point of view. In deciding to sing in Egyptian Arabic alone, Lena positions herself to be challenged and celebrated. For the Arab community, there is intrigue in listening to a foreign artist adopt the language and perform it with such passion. For audiences in the Balkans, there is excitement in witnessing one of their own venture so much farther than anticipated. In both instances, the end result is connection. She will not remain in one lane, and it is that refusal that is essentially what provides her voice power.</p>\n<p class=\"align-center\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"352\" style=\"max-width: 100%; border-radius: 12px;\" src=\"https://open.spotify.com/embed/artist/1QaIGEG2l2mZE5WwXPLADq?utm_source=generator\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\"></iframe></div>\n<p><br>Themed, Ana Elli Hena is about taking up space in a world which continually attempts to define and confine women's being. The name alone is a statement: \"I am the one here.\" The refrain throughout the song holds almost incantatory authority, as if addressed to an audience, an enemy, and a self simultaneously. A song of strength, it is indeed, but one of survival also. It resists erasure by being impossible to overlook.<br><br>The song also has a cinematic feel. One can picture it scoring a climactic scene in a movie, a confrontation, say, or a moment when the hero finally takes hold of their authority. So it is that Lena's work draws to mind such artists as Sevdaliza, whose Persian-Dutch heritage drives similarly boundary-pushing experimentation, or even M.I.A., who blended Tamil origins with London's underground culture. As they do, Lena employs pop formats and club-friendly beats as a medium for something more profound, something pegged to history, language, and identity politics.<br><br>Ana Elli Hena finds herself in a moment in culture where global pop has become more permeable. Think about how Rosalía constructed El Mal Querer from flamenco heritage into a global pop album, or the way Stromae transformed Belgian chanson into electronic anthems. JA Lena is not part of a trend, but she is part of this movement of artists not willing to let geography confine them. Serbian and Arabic traditions are not different boxes to her, but sparks waiting to ignite one another.<br><br></p>",
            "image": "https://volecho.com/media/posts/34/volecho.jpg",
            "author": {
                "name": "Volecho.com"
            },
            "tags": [
            ],
            "date_published": "2025-09-16T12:55:16+03:00",
            "date_modified": "2025-09-16T21:10:49+03:00"
        }
    ]
}
